{
    "settings": {
        "no_player_providers": "Δεν έχουν διαμορφωθεί πάροχοι προγράμματος αναπαραγωγής",
        "no_player_providers_detail": "Ρυθμίστε τους παρόχους προγραμμάτων αναπαραγωγής ώστε να επιλέγουν συσκευές όπου το Music Assistant μπορεί να εξάγει τη μουσική σας.",
        "language": {
            "options": {
                "zh_CN": "Κινεζικά (Απλοποιημένα)",
                "en_AU": "Αγγλικά (Αυστραλία)",
                "sr": "Σέρβικα",
                "sr_Latn": "Σερβικά (Λατινικά)",
                "sv_SE": "Σουηδικά",
                "en_GB": "Αγγλικά (Ηνωμένο Βασίλειο)",
                "es": "Ισπανικά",
                "pt_PT": "Πορτογαλικά"
            }
        },
        "volume_normalization_tracks": {
            "description": "Ορίστε την προτιμώμενη στρατηγική εξομάλυνσης της έντασης ήχου για κομμάτια\/τραγούδια.\\nΤο Music Assistant χρησιμοποιεί μια μέτρηση της (μέσης αντιλαμβανόμενης) έντασης ήχου των κομματιών σύμφωνα με τις προδιαγραφές EBU-R128 για να προσαρμόσει τη συνολική ενίσχυση\/ένταση της ροής χωρίς να επηρεάσει το δυναμικό εύρος του ήχου.\\nΑυτές οι μετρήσεις παρέχονται είτε από τον πάροχο ροής είτε, στην περίπτωση τοπικών αρχείων, μπορούν να περιέχονται στις ετικέτες ID3 (ReplayGain 2.0 \/ Opus R128).\\nΕάν η μέτρηση δεν παρέχεται, το Music Assistant θα εκτελέσει αυτόματα μια μέτρηση όταν\/αφού το κομμάτι αναπαραχθεί (για πρώτη φορά). Οταν δεν υπάρχει (ακόμα) μέτρηση για ένα κομμάτι, το Music Assistant θα επανέλθει από προεπιλογή σε ένα δυναμικό (αλλά λιγότερο ακριβές) φίλτρο ισοστάθμισης ηχηρότητας. Αυτό διασφαλίζει ότι δεν θα υπάρχουν μεγάλες αιχμές\/πτώσεις στο επίπεδο έντασης μεταξύ των κομματιών, ακόμη και αν δεν υπάρχει ακόμη ακριβής μέτρηση, αλλά το δυναμικό ισοπεδωτικό μπορεί μερικές φορές να συμπιέσει λίγο το δυναμικό εύρος, αν και αυτό δεν θα πρέπει να ακούγεται στις περισσότερες περιπτώσεις.\\n\\n\\n**Επιλογές:**\\n\\n - Απενεργοποιημένη - δεν εφαρμόζεται καθόλου η ομαλοποίηση της έντασης ήχου για ραδιοφωνικές ροές.\\n - Force dynamic (Επιβολή δυναμικής) - Επιβολή δυναμικής εξομάλυνσης της έντασης του ήχου ανά πάσα στιγμή. \\n - Measurement only (no fallback) - Εφαρμογή (συνολικής) διόρθωσης έντασης\/ενίσχυσης με βάση την αποθηκευμένη μέτρηση. Εάν δεν έχουμε καμία μέτρηση, να μην εφαρμόζεται κανονικοποίηση. \\n - Fallback στη διόρθωση ενίσχυσης - Εφαρμογή (συνολικής) διόρθωσης έντασης\/ενίσχυσης με βάση την αποθηκευμένη μέτρηση. Εάν δεν έχουμε καμία μέτρηση, επαναφορά σε προκαθορισμένη διόρθωση κέρδους. \\n - Fixed gain correction (Σταθερή διόρθωση ενίσχυσης) - Εφαρμογή πάντα της σταθερής διόρθωσης έντασης\/ενίσχυσης. \\n - Επαναφορά σε δυναμική - Αυτόματη επιλογή της καλύτερης επιλογής: Εφαρμογή (συνολικής) διόρθωσης έντασης\/ενίσχυσης με βάση την αποθηκευμένη μέτρηση, αν έχουμε κάποια, επιτρέπει την επαναφορά στη δυναμική λειτουργία αν δεν υπάρχει διαθέσιμη μέτρηση.\\n"
        },
        "volume_normalization_fixed_gain_radio": {
            "label": "Σταθερή\/αναδρομική ρύθμιση ενίσχυσης για το ραδιόφωνο",
            "description": "Διόρθωση σταθερής\/αναδρομικής ενίσχυσης (gain) για εφαρμογή σε μια ροή ραδιοφωνικού σήματος (εξαρτάται από τη ρύθμιση 'Μέθοδος κανονικοποίησης έντασης ήχου').\\nΧρησιμοποιήστε μια θετική τιμή για να αυξήσετε την ένταση του ήχου, μια αρνητική τιμή για να μειώσετε την ένταση του ήχου.\\n\\nΑυτή η ρύθμιση χρησιμοποιείται όταν η μέθοδος κανονικοποίησης έντασης ήχου έχει οριστεί σε 'Fixed gain correction' (Σταθερή διόρθωση ενίσχυσης) ή 'Fallback to gain correction' (Επαναφορά σε διόρθωση ενίσχυσης)."
        }
    },
    "play_replace": "Παίξε τώρα (εκκαθάριση ουράς)",
    "view": {
        "panel_compact": "Συμπαγής προβολή μικρογραφιών"
    },
    "tooltip": {
        "album_type": "Τύπος άλμπουμ",
        "loading": "Ο διακομιστής επεξεργάζεται ένα αίτημα ή συγχρονίζει μουσική.",
        "primary_image": "Αυτή είναι η κύρια εικόνα για αυτόν τον τύπο εικόνας"
    },
    "background_task_added": "Η ενέργεια εκτελείται από τον διακομιστή στο παρασκήνιο και ενδέχεται να χρειαστεί κάποιος χρόνος για να ολοκληρωθεί. Παρακολουθήστε το αρχείο καταγραφής του διακομιστή για την πρόοδο.",
    "images": "Εικόνες",
    "image_type": "Τύπος",
    "image_source": "Πηγή",
    "update_metadata": "Ενημέρωση μεταδεδομένων",
    "cancel": "Ακυρο",
    "sort": {
        "artist_name": "Καλλιτέχνης άλμπουμ",
        "artist_name_desc": "Καλλιτέχνης άλμπουμ (φθίνουσα σειρά)"
    }
}