{
    "actions": "Actions",
    "add": "Add",
    "add_library": "Add to library",
    "add_alias": "Add alias",
    "add_alias_failed": "Failed to add alias",
    "alias_added_successfully": "Alias added successfully",
    "add_genre": "Add genre",
    "genre_added_successfully": "Genre added successfully",
    "genre_add_failed": "Failed to add genre",
    "genre_deleted": "Genre deleted successfully",
    "add_playlist": "Add to playlist...",
    "add_queue": "Add to Queue",
    "add_url_item": "Add item from URL",
    "alias": "Alias",
    "album": "Album",
    "album_tracks": "Album tracks",
    "album_type": {
        "album": "Album",
        "compilation": "Compilation",
        "ep": "EP",
        "single": "Single",
        "unknown": "Unknown album type",
        "audiobook": "Audiobook",
        "podcast": "Podcast",
        "live": "Live",
        "soundtrack": "Soundtrack"
    },
    "albums": "Albums",
    "aliases": "Aliases",
    "appears_on": "Appears on",
    "artist": "Artist",
    "artist_albums": "Albums",
    "artist_toptracks": "Top tracks",
    "artists": "Artists",
    "authors": "Authors",
    "browse": "Browse",
    "clear_selection": "Clear selection",
    "close": "Close",
    "collection": "Collection",
    "collections": "Collections",
    "create_playlist": "Create new playlist on {0}",
    "crossfade_disabled": "Crossfade is disabled",
    "crossfade_enabled": "Crossfade is enabled",
    "dark_mode": "Dark mode",
    "delete_db": "Delete item from database",
    "details": "Details",
    "confirm_delete_genre": "Are you sure you want to delete this genre? The genre itself will be removed, along with its alias mappings.",
    "confirm_delete_genre_2": "Are you absolutely sure? This action cannot be undone.",
    "confirm_promote_alias": "Promote \"{0}\" to a standalone genre? This will create a new genre and remove the alias from the current genre.",
    "confirm_remove_alias": "Are you sure you want to remove the alias \"{0}\" from this genre?",
    "delete": "Delete",
    "delete_genre": "Delete genre",
    "delete_genres": "Delete {0} genres",
    "confirm_delete_genres": "Are you sure you want to delete {0} genres? The genres will be removed, along with their alias mappings.",
    "genres_deleted": "{0} genres deleted successfully",
    "description": "Description",
    "merge_into": "Merge into existing genre",
    "merge_genres": "Merge Genres",
    "merge_genres_description": "Select a target genre to merge into. All aliases and mapped media from the source genres will be transferred to the target.",
    "merge_genres_warning": "The following genres will be deleted: {0}",
    "merge_genres_success": "Genres merged successfully",
    "merge_genres_failed": "Failed to merge genres",
    "select_target_genre": "Select target genre",
    "link_to_genre": "Link to genre",
    "link_to_genre_title": "Link to Genre",
    "link_to_genre_description": "Select a genre to link the selected items to.",
    "link_to_genre_success": "Successfully linked to genre",
    "link_to_genre_failed": "Failed to link to genre",
    "edit": "Edit",
    "enter_url": "Enter the URL you want to manually add to the database",
    "external_source_active": "External source active: {0}",
    "genre": "Genre",
    "genres": "Genres",
    "genre_names": {
        "afrobeats": "Afrobeats (west african urban/pop music)",
        "ambient": "Ambient",
        "anime_and_video_game_music": "Anime & video game music",
        "asian_music": "Asian music",
        "bluegrass": "Bluegrass",
        "blues": "Blues",
        "brazilian_music": "Brazilian music",
        "chanson": "Chanson",
        "childrens_music": "Children's music",
        "christmas_music": "Christmas music",
        "church_music": "Church music",
        "classical": "Classical",
        "comedy": "Comedy",
        "country": "Country",
        "dance": "Dance",
        "dark_ambient": "Dark ambient",
        "dark_wave": "Dark wave",
        "disco": "Disco",
        "electronic": "Electronic",
        "experimental": "Experimental",
        "field_recording": "Field recording",
        "folk": "Folk",
        "funk": "Funk",
        "gangsta_rap": "Gangsta rap",
        "gospel": "Gospel",
        "hip_hop": "Hip hop",
        "indian_classical": "Indian classical",
        "industrial": "Industrial",
        "jazz": "Jazz",
        "klezmer": "Klezmer",
        "latin": "Latin",
        "marching_band": "Marching band",
        "metal": "Metal",
        "middle_eastern_music": "Middle eastern music",
        "musical": "Musical",
        "new_age": "New age",
        "poetry": "Poetry",
        "polka": "Polka",
        "pop": "Pop",
        "psychedelic": "Psychedelic",
        "punk": "Punk",
        "r_b": "R&b",
        "ragtime": "Ragtime",
        "rai": "Raï",
        "reggae": "Reggae",
        "reggaeton": "Reggaeton",
        "rock": "Rock",
        "salsa": "Salsa",
        "singer_songwriter": "Singer-songwriter",
        "ska": "Ska",
        "soul": "Soul",
        "sound_effects": "Sound effects",
        "soundtrack": "Soundtrack",
        "spoken_word": "Spoken word",
        "swing": "Swing",
        "tango": "Tango",
        "trap": "Trap",
        "waltz": "Waltz",
        "wellness": "Wellness"
    },
    "genre_descriptions": {
        "afrobeats": "Afrobeats, not to be confused with Afrobeat or Afroswing, is an umbrella term to describe popular music from West Africa and the diaspora that initially developed in Nigeria, Ghana, and the UK in the 2000s and 2010s. Afrobeats is less of a style per se, and more of a descriptor for the fusion of sounds flowing out of Nigeria and Ghana. Genres such as hiplife, jùjú music, highlife, azonto music, and naija beats, among others, were amalgamated under the \"Afrobeats\" umbrella.",
        "ambient": "Ambient music is a genre of music that emphasizes tone and atmosphere over traditional musical structure or rhythm. Often \"peaceful\" sounding and lacking composition, beat, and/or structured melody, ambient music uses textural layers of sound that can reward both passive and active listening, and encourage a sense of calm or contemplation. The genre evokes an \"atmospheric\", \"visual\", or \"unobtrusive\" quality. Nature soundscapes may be included, and some works use sustained or repeated notes, as in drone music. Bearing elements associated with new-age music, instruments such as the piano, strings and flute may be emulated through a synthesizer.",
        "anime_and_video_game_music": "Video game music (VGM) is the soundtrack that accompanies video games. Early video game music was once limited to sounds of early sound chips, such as programmable sound generators (PSG) or FM synthesis chips. These limitations have led to the style of music known as chiptune, which became the sound of the early video games.",
        "asian_music": "Asian music encompasses numerous musical styles, diverse cultural and religious traditions, and forms originating on the Asian continent.",
        "bluegrass": "Bluegrass music is a genre of American roots music that developed in the 1940s in the Appalachian region of the United States. The genre derives its name from the band Bill Monroe and the Blue Grass Boys. Bluegrass has roots in African American genres like blues and jazz and North European genres, such as Irish ballads and dance tunes. Unlike country, it is traditionally played exclusively on acoustic instruments such as the fiddle, mandolin, banjo, guitar and upright bass. It was further developed by musicians who played with Monroe, including 5-string banjo player Earl Scruggs and guitarist Lester Flatt. Bill Monroe once described bluegrass music as, \"It's a part of Methodist, Holiness and Baptist traditions. It's blues and jazz, and it has a high lonesome sound.\"",
        "blues": "Blues is a music genre and musical form that originated among African Americans in the Deep South of the United States around the 1860s. Blues has incorporated spirituals, work songs, field hollers, shouts, chants, and rhymed simple narrative ballads from the African-American culture. The blues form is ubiquitous in jazz, rhythm and blues, and rock and roll, and is characterized by the call-and-response pattern, the blues scale, and specific chord progressions, of which the twelve-bar blues is the most common. Blue notes, usually thirds, fifths or sevenths flattened in pitch, are also an essential part of the sound. Blues shuffles or walking bass reinforce the trance-like rhythm and form a repetitive effect known as the groove.",
        "brazilian_music": "The music of Brazil encompasses various regional musical styles influenced by European, American, African and Amerindian forms. Brazilian music developed some unique and original styles such as forró, repente, coco de roda, axé, sertanejo, samba, bossa nova, MPB, gaucho music, pagode, tropicália, choro, maracatu, embolada, frevo, brega, modinha and Brazilian versions of foreign musical styles, such as rock, pop music, soul, hip-hop, disco music, country music, ambient, industrial and psychedelic music, rap, classical music, fado, and gospel.",
        "chanson": "A chanson is generally any lyric-driven French song. The term is most commonly used in English to refer either to the secular polyphonic French songs of late medieval and Renaissance music or to a specific style of French pop music which emerged in the 1950s and 1960s. The genre had origins in the monophonic songs of troubadours and trouvères, though the only polyphonic precedents were 16 works by Adam de la Halle and one by Jehan de Lescurel. Not until the ars nova composer Guillaume de Machaut did any composer write a significant number of polyphonic chansons.",
        "childrens_music": "Children's music or kids' music is music composed and performed for children. In European-influenced contexts this means music, usually songs, written specifically for a juvenile audience. The composers are usually adults.",
        "christmas_music": "Christmas music comprises a variety of genres of music regularly performed or heard around the Christmas season. Music associated with Christmas may be purely instrumental, or in the case of carols, may employ lyrics about the nativity of Jesus Christ, traditions such as gift-giving and merrymaking, cultural figures such as Santa Claus, or other topics. Many songs simply have a winter or seasonal theme, or have been adopted into the canon for other reasons.",
        "church_music": "Church music is a genre of Christian music written for performance in church, or any musical setting of ecclesiastical liturgy, or music set to words expressing propositions of a sacred nature, such as a hymn.",
        "classical": "Art music is music considered to be of high phonoaesthetic value. It typically implies advanced structural and theoretical considerations or a written musical tradition. In this context, the terms \"serious\" or \"cultivated\" are frequently used to present a contrast with ordinary, everyday music. Many cultures have art music traditions; in the Western world, the term typically refers to Western classical music.",
        "comedy": "Comedy music or musical comedy is a genre of music that is comedic in nature. Its history can be traced back to the first century in ancient Greece and Rome, moving forward in time to the Medieval Period, Classical and Romantic eras, and the 20th century. Various forms of comedic musical theatre, including \"musical play\", \"musical comedy\", \"operetta\" and \"light opera\", evolved from the comic operas first developed in late 17th-century Italy. Popular music artists in the 20th century interested in comedy include Allan Sherman, Frank Zappa, Tiny Tim, Barenaked Ladies, Randy Newman, and \"Weird Al\" Yankovic. Artists in the 21st century include Tenacious D, Flight of the Conchords, The Lonely Island, Ninja Sex Party and The Axis of Awesome.",
        "country": "Country music, also known as country and western or simply country, is a music genre known for its ballads and dance tunes, identifiable by both traditional lyrics and harmonies accompanied by banjos, mandolins, fiddles, harmonicas, and many types of guitar; either acoustic, electric, steel, or resonator guitars. Once called hillbilly music, the term country music was popularized in the 1940s to give it a correct term.",
        "dance": "Dance music is music composed specifically to facilitate or accompany dancing. It can be either a whole piece or part of a larger musical arrangement. In terms of performance, the major categories are live dance music and recorded dance music. While there exist attestations of the combination of dance and music in ancient history, the earliest Western dance music that we can still reproduce with a degree of certainty are old-fashioned dances. In the Baroque period, the major dance styles were noble court dances. In the classical music era, the minuet was frequently used as a third movement, although in this context it would not accompany any dancing. The waltz also arose later in the classical era. Both remained part of the romantic music period, which also saw the rise of various other nationalistic dance forms like the barcarolle, mazurka, ecossaise, ballade and polonaise.",
        "dark_ambient": "Dark ambient is a subgenre of post-industrial music, that originally emerged in the mid-1980s. It draws primary influence from ambient music and is characterized by ominous, dark drones, discordant overtones and a gloomy, monumental or catacomb-inspired atmosphere. Although mostly an electronic genre, artists frequently sample traditional instruments and make use of semi-acoustic recording procedures.",
        "dark_wave": "Dark wave is a music genre that emerged from the new wave and post-punk movement of the late 1970s. Dark wave compositions are largely based on minor key tonality and introspective lyrics and have been perceived as being dark, romantic and bleak, with an undertone of sorrow. Common features include the use of chordophones such as electric and acoustic guitar, violin and piano, as well as electronic instruments such as synthesizer, sampler and drum machine. Like new wave, dark wave is not a \"unified genre but rather an umbrella term\" that encompasses a variety of musical styles, including cold wave, ethereal wave, gothic rock, neoclassical dark wave and neofolk.",
        "disco": "Disco is a genre of dance music and a subculture that emerged in the late 1960s from the United States' urban nightlife scene, particularly in African-American, Italian-American, Latino and queer communities. Its sound is typified by four-on-the-floor beats, syncopated basslines, string sections, brass and horns, electric pianos, synthesizers, and electric rhythm guitars.",
        "electronic": "Electronic music broadly is a group of music genres that employ electronic musical instruments, circuitry-based music technology and software, or general-purpose electronics in its creation. It includes both music made using electronic and electromechanical means. Pure electronic instruments depend entirely on circuitry-based sound generation, for instance using devices such as an electronic oscillator, theremin, or synthesizer: no acoustic waves need to be previously generated by mechanical means and then converted into electrical signals. On the other hand, electromechanical instruments have mechanical parts such as strings or hammers that generate the sound waves, together with electric elements including magnetic pickups, power amplifiers and loudspeakers that convert the acoustic waves into electrical signals, process them and convert them back into sound waves. Such electromechanical devices include the telharmonium, Hammond organ, electric piano and electric guitar.",
        "experimental": "Experimental music is a general label for any music or music genre that pushes existing boundaries and genre definitions. Experimental compositional practice is defined broadly by exploratory sensibilities radically opposed to, and questioning of, institutionalized compositional, performing, and aesthetic conventions in music. Elements of experimental music include indeterminacy, in which the composer introduces the elements of chance or unpredictability with regard to either the composition or its performance. Artists may approach a hybrid of disparate styles or incorporate unorthodox and unique elements.",
        "field_recording": "Field recording is the production of audio recordings outside recording studios, and the term applies to recordings of both natural and human-produced sounds. It can also include the recording of electromagnetic fields or vibrations using different microphones like a passive magnetic antenna for electromagnetic recordings or contact microphones, or underwater field recordings made with hydrophones to capture the sounds and/or movements of whales, or other sealife. These recordings are often regarded as being very useful for sound designers and foley artists.",
        "folk": "Folk music is a music genre that includes traditional folk music and the contemporary genre that evolved from the former during the 20th-century folk revival. Some types of folk music may be called world music. Traditional folk music has been defined in several ways: as music transmitted orally, music with unknown composers, music that is played on traditional instruments, music about cultural or national identity, music that changes between generations, music associated with a people's folklore, or music performed by custom over a long period of time. It has been contrasted with commercial and classical styles. The term originated in the 19th century, but folk music extends beyond that.",
        "funk": "Funk is a music genre that originated in African-American communities in the mid-1960s when musicians created a rhythmic, danceable new form of music through a mixture of various music genres that were popular among African-Americans in the mid-20th century. It deemphasizes melody and chord progressions and focuses on a strong rhythmic groove of a bassline played by an electric bassist and a drum part played by a percussionist, often at slower tempos than other popular music. Funk typically consists of a complex percussive groove with rhythm instruments playing interlocking grooves that create a \"hypnotic\" and \"danceable\" feel. Early funk, specifically James Brown, fused jazz and blues, and added a syncopated drum groove.",
        "gangsta_rap": "Gangsta or gangster rap, initially called reality rap, is a subgenre of hip-hop that conveys the culture, values, and experiences of urban gangs and street hustlers, frequently discussing unpleasant realities of the world in general through an urban lens. Emerging in the late 1980s, gangsta rap's pioneers include Schoolly D and Ice-T, later expanding with artists such as N.W.A. In 1992, via record producer and rapper Dr. Dre, rapper Snoop Dogg, and their G-funk sound, gangster rap broadened to mainstream popularity.",
        "gospel": "Gospel music is a traditional genre of Christian music and a cornerstone of Christian media, characterized by dominant vocals and lyrics that reflect Christian teachings and values. The creation, performance, significance, and even the definition of gospel music vary according to culture and social context. Gospel music is composed and performed for many purposes, including aesthetic pleasure, and also religious or ceremonial purposes, and as an entertainment product for the marketplace. Gospel music can be traced to the early 17th century.",
        "hip_hop": "Hip-hop is a genre of popular music that emerged in the early 1970s alongside an associated subculture in the African-American and Caribbean immigrants communities of New York City. The musical style is characterized by the synthesis of a wide range of techniques, but rapping is frequent enough that it has become a defining characteristic. Other key markers of the genre are the disc jockey (DJ), turntablism, scratching, beatboxing, and instrumental tracks. Cultural interchange has always been central to the hip-hop genre; it simultaneously borrows from its social environment while commenting on it.",
        "indian_classical": "Indian classical music is the classical music of the Indian subcontinent. It is generally described using terms like Shastriya Sangeet and Marg Sangeet. It has two major traditions: the North Indian classical music known as Hindustani and the South Indian expression known as Carnatic. Hindustani music emphasizes improvisation and exploration of all aspects of a raga, while Carnatic performances tend to be short composition-based. However, the two systems continue to have more common features than differences. Another unique classical music tradition from the eastern part of India is Odissi music, which has evolved over the last two thousand years.",
        "industrial": "Industrial music is a subgenre of experimental music inspired by post-industrial society, initially drawing influences from avant-garde and early electronic music genres such as musique concrète, tape music, noise and sound collage. The term was coined in 1976 by Monte Cazazza and adopted by Throbbing Gristle with the founding of Industrial Records. Other early industrial musicians include NON and Cabaret Voltaire. By the late 1970s, additional artists emerged such as Clock DVA, Nocturnal Emissions, Einstürzende Neubauten, SPK, Nurse with Wound, and Z’EV, alongside Whitehouse who coined the subgenre \"power electronics\".",
        "jazz": "Jazz is a music genre that originated in the African-American communities of New Orleans, Louisiana, in the late 19th and early 20th centuries. Its roots are in blues, ragtime, European harmony, African rhythmic rituals, spirituals, hymns, marches, vaudeville song, and dance music. Since the 1920s Jazz Age, it has been recognized as a major form of musical expression in traditional and popular music. Jazz is characterized by swing and blue notes, complex chords, call and response vocals, polyrhythms and improvisation.",
        "klezmer": "Klezmer is an instrumental musical tradition of the Ashkenazi Jews of Central and Eastern Europe. The essential elements of the tradition include dance tunes, ritual melodies, and virtuosic improvisations played for listening; these would have been played at weddings and other social functions. The musical genre incorporated elements of many other musical genres including Ottoman music, Baroque music, German and Slavic folk dances, and religious Jewish music. As the music arrived in the United States, it lost some of its traditional ritual elements and adopted elements of American big band and popular music. Among the European-born klezmers who popularized the genre in the United States in the 1910s and 1920s were Dave Tarras and Naftule Brandwein; they were followed by American-born musicians such as Max Epstein, Sid Beckerman and Ray Musiker.",
        "latin": "Latin music is a term used by the music industry as a catch-all category for various styles of music from Ibero-America, which encompasses Latin America, Spain, Portugal, and the Latino population in Canada and the United States, as well as music that is sung in either Spanish or Portuguese. It may also include music from other territories where Spanish- and Portuguese-language music is made.",
        "marching_band": "Marching band is a performance-based, visual-musical genre featuring musicians playing brass, woodwind, and percussion instruments while moving in synchronized, choreographed formations, usually at 120-160+ beats per minute. It blends musical performance with athletic, high-speed marching, often incorporating pop, rock, and classical music alongside traditional military-style marches.",
        "metal": "umbrella category of music genres of metal branch, derived from heavy metal music while not necessarily being its subgenre",
        "middle_eastern_music": "The various nations of the region include the Arabic-speaking countries of the Middle East, the traditional Persian ritual music, the Jewish music of Israel and the diaspora, Kurdish music, Armenian music. Azeri Music, the varied traditions of Cypriot music, the Turkish music of Turkey, traditional Assyrian music, Coptic ritual music in Egypt as well as other genres of Egyptian music in general. It is widely regarded that some Middle-Eastern musical styles have influenced Central Asia, as well as the Balkans, Southern Italy, and Spain.",
        "musical": "Musical theatre is a form of theatrical performance that combines songs, spoken dialogue, acting and dance. The story and emotional content of a musical – humor, pathos, love, anger – are communicated through words, music, movement and technical aspects of the entertainment as an integrated whole. Although musical theatre overlaps with other theatrical forms like opera and dance, it may be distinguished by the equal importance given to the music as compared with the dialogue, movement and other elements. Since the early 20th century, musical theatre stage works have generally been called, simply, musicals.",
        "new_age": "New age is a genre of music intended to create artistic inspiration, relaxation, and optimism. It is used by listeners for yoga, massage, meditation, and reading as a method of stress management to bring about a state of ecstasy rather than trance, or to create a peaceful atmosphere in homes or other environments. It is sometimes associated with environmentalism and New Age spirituality; however, most of its artists have nothing to do with \"New Age spirituality\", and some even reject the term.",
        "poetry": "Poetry as a musical genre merges spoken-word or recited verse with musical accompaniment, creating a hybrid form focused on emotional expression, storytelling, and rhythm. Often featuring acoustic instruments (piano, guitar) or experimental soundscapes, this genre blurs the line between literature and song,, highlighting the inherent melody and cadence in spoken words.",
        "polka": "Polka is a dance style and genre of dance music in 24 originating in nineteenth-century Bohemia, now part of the Czech Republic. Though generally associated with Czech and Central European culture, polka is popular throughout Europe and the Americas.",
        "pop": "Pop music, or simply pop, is a genre of popular music that originated in its modern form during the mid-1950s in the United States and the United Kingdom. During the 1950s and 1960s, pop music encompassed rock and roll and the youth-oriented styles it influenced. Rock and pop music remained roughly synonymous until the late 1960s, after which pop became associated with music that was more commercial, ephemeral, and accessible.",
        "psychedelic": "Psychedelic music is a wide range of popular music styles and genres influenced by 1960s psychedelia, a subculture of people who used psychedelic drugs such as DMT, LSD, mescaline, and psilocybin mushrooms, to experience synesthesia and altered states of consciousness. Psychedelic music may also aim to enhance the experience of using these drugs and has been found to have a significant influence on psychedelic therapy.",
        "punk": "umbrella category of music genres related to punk subculture, derived from punk rock music scene while not necessarily being its subgenre",
        "r_b": "Rhythm and blues, frequently abbreviated as R&B or R'n'B, is a genre of popular music that originated within African American communities in the 1940s. The term was originally used by record companies to describe recordings marketed predominantly to African Americans, at a time when \"rocking, jazz based music ... [with a] heavy, insistent beat\" was starting to become more popular.\nIn the commercial rhythm and blues music typical of the 1950s through the 1970s, the bands usually consisted of a piano, one or two guitars, bass, drums, one or more saxophones, and sometimes background vocalists. R&B lyrical themes often encapsulate the African-American history and experience of pain and the quest for freedom and joy, as well as triumphs and failures in terms of societal racism, oppression, relationships, economics, and aspirations.",
        "ragtime": "Ragtime, also spelled rag-time or rag time, is a musical style noted for its syncopated or \"ragged\" rhythm. It originated in African American communities in the late 19th century and was propelled to popularity in the 1890s to 1910s by composers such as James Scott, Joseph Lamb, and particularly Scott Joplin. Known as the \"King of Ragtime\", Joplin gained fame through compositions like \"Maple Leaf Rag\" and \"The Entertainer\".",
        "rai": "Raï, sometimes written rai, is a form of Algerian folk music that dates back to the 1920s. Singers of Raï are called cheb (شاب) or cheba (شابة), i.e. 'young', as opposed to sheikh, i.e. 'old', the name given to Chaabi singers. The tradition arose in the city of Oran, primarily among the poor. Traditionally sung by men, by the end of the 20th century, female singers became common. The lyrics have concerned social issues such as disease and the policing of European colonies that affected native populations.",
        "reggae": "Reggae is a music genre that originated in Jamaica in the late 1960s. The term also refers to the modern popular music of Jamaica and its diaspora. The 1968 single by Toots and the Maytals titled \"Do the Reggay\" was the first popular song to use the word reggae, effectively naming the genre and introducing it to a global audience.",
        "reggaeton": "Reggaeton is a style of popular and electronic music that originated in Panama during the late 1980s. It has been popularized and dominated by artists from Puerto Rico since the early 1990s.",
        "rock": "Rock music is a genre of popular music that originated in the United States as \"rock and roll\" in the late 1940s and early 1950s, developing into a range of styles from the mid-1960s, primarily in the United States and United Kingdom. It has its roots in rock and roll, a style that drew from the African-American musical genres of blues and rhythm and blues, as well as from country music. Rock also drew strongly from genres such as electric blues and folk, and incorporated influences from jazz and other styles. Rock is typically centered on the electric guitar, usually as part of a rock group with electric bass guitar, drums, and one or more singers.",
        "salsa": "Salsa music is a style of Latin American music, combining elements of Cuban and Puerto Rican influences. Because most of the basic musical components predate the labeling of salsa, there have been many controversies regarding its origin. Most songs considered as salsa are primarily based on son montuno and son cubano, with elements of cha-cha-chá, bolero, rumba, mambo, jazz, R&B, bomba, and plena. All of these elements are adapted to fit the basic Son montuno template when performed within the context of salsa.",
        "singer_songwriter": "group of musical genres that emerged in the mid-20th century, referring to the music of singer-songwriters, often characterised by political or personal lyrics and minimal acoustic accompaniment",
        "ska": "Ska is a music genre that originated in Jamaica in the late 1950s and was the precursor to rocksteady and reggae. It combined elements of Caribbean mento and calypso with American jazz and rhythm and blues. Ska is characterized by a walking bass line accented with rhythms on the off beat. It was developed in Jamaica in the 1960s when Stranger Cole, Prince Buster, Clement \"Coxsone\" Dodd, and Duke Reid formed sound systems to play American rhythm and blues and then began recording their own songs. In the early 1960s, ska was the dominant music genre of Jamaica and was popular with British mods and with many skinheads.",
        "soul": "Soul music is a popular music genre that originated in African-American communities throughout the United States in the late 1950s and early 1960s. Catchy rhythms, stressed by handclaps and extemporaneous body movements, are an important hallmark of soul. Other characteristics are a call and response between the lead and backing vocalists, an especially tense vocal sound, and occasional improvisational additions, twirls, and auxiliary sounds. Soul music is known for reflecting African-American identity and stressing the importance of African-American culture.",
        "sound_effects": "Sound effects as a musical genre—often encompassing soundscape composition, musique concrète, and noise music—utilize environmental noises, mechanical sounds, and Foley recordings as primary musical elements rather than traditional melodies or harmonies. This avant-garde approach creates immersive, narrative, and textured auditory experiences.",
        "soundtrack": "A film score is original music written specifically to accompany a film or a television program. The score consists of a number of orchestral, instrumental, or choral pieces called cues, which are timed to begin and end at specific points during the film to enhance the dramatic narrative and emotional impact of scenes. Scores are written by one or more composers under the guidance of or in collaboration with the film's director or producer and are then most often performed by an ensemble of musicians – usually including an orchestra or band, instrumental soloists, and choir or vocalists – known as playback singers – and recorded by a sound engineer. The term is less frequently applied to music written for media such as live theatre, television and radio programs, and video games, and that music is typically referred to as either the soundtrack or incidental music.",
        "spoken_word": "Spoken word is a performance-based genre combining spoken poetry, storytelling, or monologue with musical accompaniment or rhythmic delivery, focusing on the voice as the primary instrument. Rooted in oral traditions and the Beat Generation, it merges literary artistry with music, commonly featuring themes of social justice, politics, and personal narrative, often accompanied by jazz, rock, or folk elements.",
        "swing": "Swing music is a style of jazz that developed in the United States during the late 1920s and early 1930s. It became nationally popular from the mid-1930s. Swing represents the most famous era of jazz as a genre of entertainment, before the emergence of modern jazz. Swing bands usually featured soloists who would improvise on the melody over the arrangement. The danceable swing style of big bands and bandleaders such as Fletcher Henderson and Benny Goodman was the dominant form of American popular music from 1935 to 1946, known as the swing era, when people were dancing the Lindy Hop. The verb \"to swing\" is also used as a term of praise for playing that has a strong groove or drive. Big band leaders of the swing era include Benny Goodman, Duke Ellington, Count Basie, Jimmie Lunceford, Cab Calloway, Benny Carter, Jimmy Dorsey, Tommy Dorsey, Earl Hines, Bunny Berigan, Harry James, Lionel Hampton, Glenn Miller, and Artie Shaw.",
        "tango": "Tango is a style of music in 24 or 44 time that originated in Uruguay and Argentina among European immigrants in the late 19th and early 20th centuries. It has mainly Spanish, Italian, Gaucho, African, and French cultural roots. It is traditionally played on a solo guitar, guitar duo, or an ensemble, known as the orquesta típica, which includes at least two violins, flute, piano, double bass, and at least two bandoneóns. Sometimes guitars and a clarinet join the ensemble. Tango may be purely instrumental or may include a vocalist. Tango music and dance have become popular throughout the world.",
        "trap": "Trap music, also known simply as trap, is a subgenre of hip-hop music that originated in the Southern United States. Lyrical references to trap started in 1991 but the modern sound of trap appeared in 1999. The genre gets its name from the Atlanta term \"trap house\", a drug house. Trap music features simple, rhythmic, minimalistic productions that use synthesized drums and is characterized by complex hi-hat drum beats, snare drums, bass drums, some tuned with a long decay to emit a bass frequency. Lyrics often focus on drug use and urban violence.",
        "waltz": "A waltz, probably deriving from German Ländler, is dance music in triple metre, often written in 34 time. A waltz typically sounds one chord per measure, and the accompaniment style particularly associated with the waltz is to play the root of the chord on the first beat, the upper notes on the second and third beats.",
        "wellness": "Meditation music is music performed to aid in the practice of meditation. It can have a specific religious content, but also more recently has been associated with modern composers who use meditation techniques in their process of composition, or who compose such music with no particular religious group as a focus. The concept also includes music performed as an act of meditation."
    },
    "goto_album": "Go to album {0}",
    "goto_artist": "Go to artist {0}",
    "discover": "Discover",
    "items_selected": "{0} item(s) selected",
    "items_total": "{0} total item(s)",
    "link": "Link",
    "link_alias": "Link alias",
    "link_alias_failed": "Failed to link alias",
    "alias_linked_successfully": "Alias linked successfully",
    "mapped_aliases": "Mapped Aliases",
    "library": "Library",
    "loading": "Data is being retrieved from the server.",
    "mass": "Music Assistant",
    "narrators": "Narrators",
    "new_playlist_name": "Enter a name for the new playlist",
    "no_aliases": "No aliases linked yet.",
    "no_content": "No items found.",
    "no_content_filter": "No items found for the current filter\/search conditions.",
    "no_player": "No player selected",
    "off": "Off",
    "on": "On",
    "other_versions": "Other versions",
    "perform_action": "Perform action on {0} item(s)",
    "player_options": {
        "open": "Open player options",
        "settable": "Settable player options for player {0}",
        "read_only": "Read-only player options for player {0}"
    },
    "play": "Play",
    "play_album_from": "Play Album from here",
    "play_next": "Play Next",
    "promote": "Promote",
    "promote_alias": "Promote to genre",
    "promote_alias_failed": "Failed to promote alias",
    "promote_alias_successfully": "Alias promoted successfully",
    "play_now": "Play Now",
    "play_on": "Play on: {0}",
    "play_playlist_from": "Play Playlist from here",
    "play_radio": "Start Radio",
    "player_tip": {
        "selected_player": "Selected player",
        "currently_playing": "Currently playing on",
        "click_to_change": "Click below to change output device"
    },
    "player_type": {
        "group": "Group",
        "player": "Player",
        "stereo_pair": "Stereo Pair",
        "sync_group": "Sync Group"
    },
    "players": "Players",
    "playlist": "Playlist",
    "playlist_tracks": "Playlist tracks",
    "playlists": "Playlists",
    "provider_details": "Provider details",
    "queue": "Queue",
    "queue_clear": "Clear queue",
    "queue_delete": "Delete item",
    "queue_empty": "No items in the queue",
    "queue_move_down": "Move down",
    "queue_move_up": "Move up",
    "queue_move_end": "Move to end",
    "queue_next_items": "Next items",
    "queue_options": "Queue options",
    "queue_previous_items": "Played items",
    "queue_radio_based_on": "The queue is dynamically filled with tracks based on:",
    "queue_radio_enabled": "Radio mode is enabled",
    "radios": "Radio",
    "read_more": "read more",
    "refresh_item": "Refresh item",
    "remove": "Remove",
    "remove_alias": "Remove alias",
    "remove_alias_failed": "Failed to remove alias",
    "remove_library": "Remove from library",
    "remove_playlist": "Remove from playlist",
    "search": "Search",
    "series_plural": "Series",
    "series_singular": "Series",
    "server_state": {
        "starting": "The server is starting up, some providers, players or features may not yet be available until startup is completed.",
        "stopping": "Server is shutting down...",
        "stopped": "Server has stopped"
    },
    "settings": {
        "add_new": "Add new",
        "add_provider": "Add a new provider",
        "advanced_settings": "Advanced settings",
        "check_docs": "Check out the documentation",
        "config_player": "Configure player: {0}",
        "configure": "Configure",
        "delete": "Delete",
        "disable": "Disable",
        "documentation": "Documentation",
        "enable": "Enable",
        "enable_player": "Enable this player",
        "enable_provider": "Enable this provider entry",
        "enabled": "Enable",
        "invalid_input": "The input is invalid",
        "metadataproviders": "Metadata providers",
        "musicproviders": "Music providers",
        "need_help_setup_provider": "Need help setting up this provider ?",
        "no_providers": "No Music Providers configured",
        "no_providers_detail": "Start your Music Assistant experience by adding your Music providers below.",
        "not_loaded": "The provider is not (yet) loaded",
        "password": "Password",
        "player_address": "Address",
        "player_disabled": "This player is disabled",
        "player_id": "Player ID",
        "player_model": "Model",
        "player_name": "Custom player name",
        "player_not_available": "This player is not (yet) available",
        "player_provider": "Provider",
        "player_settings": "Player settings",
        "player_type_label": "Player type",
        "playerproviders": "Player providers",
        "players": "Players",
        "pluginproviders": "Plugin providers",
        "provider_disabled": "This provider entry is disabled",
        "provider_requires_attention": "This provider requires attention",
        "provider_requires_attention_detail": "One or more providers require attention. Please check the provider settings.",
        "reconfigure": "Reconfigure",
        "fix_now": "Fix now",
        "provider_name": "Custom name for this provider entry",
        "providers": "Providers",
        "reload": "Reload",
        "save": "Save",
        "settings": "Settings",
        "settings_saved": "Settings saved successfully",
        "setup_provider": "Setup provider: {0}",
        "sync": "Synchronize now",
        "sync_running": "This provider is now being synchronized",
        "username": "Username",
        "core_modules": "Core modules",
        "server_info": "Server information",
        "server_id": "Server ID",
        "server_version": "Server version",
        "server_base_url": "Base URL",
        "server_as_addon": "Home Assistant add-on",
        "artists_in_library": "Artists in library",
        "albums_in_library": "Albums in library",
        "tracks_in_library": "Tracks in library",
        "playlists_in_library": "Playlists in library",
        "radio_in_library": "Radio in library",
        "server_logging": "Server logging",
        "download_log": "Download logfile",
        "edit_group_members": "Edit group members",
        "add_new_provider_button": "Add {0} provider",
        "add_group_player": "Add group player",
        "group_members": "Group members",
        "log_level": {
            "label": "Log level",
            "description": "Set the log verbosity for this provider.",
            "options": {
                "global": "Global",
                "info": "Info",
                "warning": "Warning",
                "error": "Error",
                "debug": "Debug"
            }
        },
        "flow_mode": {
            "label": "Enable queue flow mode",
            "description": "Enable \"flow\" mode where all queue tracks are sent as a continuous audio stream.\nUse for players that do not natively support gapless and\/or crossfading or if the player has trouble transitioning between tracks."
        },
        "auto_play": {
            "label": "Automatically play (resume on power on)",
            "description": "When this player is turned ON, automatically start playing (if there are items in the queue)."
        },
        "output_channels": {
            "label": "Output Channel Mode",
            "description": "You can configure this player to play only the left or right channel, for example to create a stereo pair with 2 players.",
            "options": {
                "stereo": "Stereo (both channels)",
                "left": "Left channel only",
                "right": "Right channel only",
                "mono": "Mono (both channels)"
            }
        },
        "volume_normalization": {
            "label": "Enable volume normalization (EBU-R128 based)",
            "description": "Enable volume normalization based on the EBU-R128 standard without affecting dynamic range"
        },
        "volume_normalization_target": {
            "label": "Target level for volume normalization",
            "description": "Adjust average (perceived) loudness to this target level, default is -17 LUFS\n\n**WARNING:** Setting the level too high may result in clipping!"
        },
        "eq_bass": {
            "label": "Equalizer: bass",
            "description": "Use the built-in basic equalizer to adjust the bass (low tones) level of the audio."
        },
        "eq_mid": {
            "label": "Equalizer: mid",
            "description": "Use the built-in basic equalizer to adjust the mid level of audio."
        },
        "eq_treble": {
            "label": "Equalizer: treble",
            "description": "Use the built-in basic equalizer to adjust the treble (high tones) level of audio."
        },
        "crossfade": {
            "label": "Enable crossfade",
            "description": "Enable a crossfade transition between (queue) tracks."
        },
        "crossfade_duration": {
            "label": "Crossfade duration",
            "description": "Duration in seconds of the crossfade between tracks (if enabled)"
        },
        "hide_player": {
            "label": "Hide this player in the user interface",
            "description": "Hide this player in the user interface.\n\nNote that it can still be controlled and it will also show up in any sync groups the player belongs to."
        },
        "default_enqueue_select_artist": {
            "label": "Items to select when you play an (in-library) artist.",
            "description": "If you want to play an artist, what items should be enqueued?",
            "options": {
                "library_tracks": "Only in-library tracks",
                "library_album_tracks": "All tracks from all albums in the library",
                "all_tracks": "All (top) tracks from (all) provider(s)",
                "all_album_tracks": "All tracks from all albums from (all) provider(s)"
            }
        },
        "default_enqueue_select_album": {
            "label": "Items to select when you play an (in-library) album.",
            "description": "If you want to play an album, what items should be enqueued?",
            "options": {
                "library_tracks": "Only in-library tracks",
                "all_tracks": "All tracks for album on provider"
            }
        },
        "default_enqueue_action_artist": {
            "label": "Default enqueue option for Artist item(s).",
            "description": "Define the default enqueue action for this media type (if you did not specify an action).",
            "options": {
                "play": "Play artist track(s) now and keep the remaining queue item(s).",
                "replace": "Clear the queue and play the artist track(s)",
                "next": "Play the item(s) right after the currently played\/buffered item.",
                "replace_next": "Clear the queue and play the artist track(s) right after the currently played\/buffered item.",
                "add": "Add the artist track(s) at the end of the queue."
            }
        },
        "default_enqueue_action_album": {
            "label": "Default enqueue option for Album item(s).",
            "description": "Define the default enqueue action for this media type (if you did not specify an action).",
            "options": {
                "play": "Play album track(s) now and keep the remaining queue item(s).",
                "replace": "Clear the queue and play the album track(s)",
                "next": "Play the item(s) right after the currently played\/buffered item.",
                "replace_next": "Clear the queue and play the album track(s) right after the currently played\/buffered item.",
                "add": "Add the album track(s) at the end of the queue."
            }
        },
        "default_enqueue_action_track": {
            "label": "Default enqueue option for Track item(s).",
            "description": "Define the default enqueue action for this media type (if you did not specify an action).",
            "options": {
                "play": "Play track(s) now and keep the remaining queue item(s).",
                "replace": "Clear the queue and play the track(s).",
                "next": "Play the track(s) right after the currently played\/buffered item.",
                "replace_next": "Clear the queue and play the track(s) right after the currently played\/buffered item.",
                "add": "Add the track(s) at the end of the queue."
            }
        },
        "default_enqueue_action_playlist": {
            "label": "Default enqueue option for Playlist item(s).",
            "description": "Define the default enqueue action for this media type (if you did not specify an action).",
            "options": {
                "play": "Play playlist track(s) now and keep the remaining queue item(s).",
                "replace": "Clear the queue and play the playlist track(s)",
                "next": "Play the item(s) right after the currently played\/buffered item.",
                "replace_next": "Clear the queue and play the playlist track(s) right after the currently played\/buffered item.",
                "add": "Add the playlist track(s) at the end of the queue."
            }
        },
        "default_enqueue_action_radio": {
            "label": "Default enqueue option for Radio item(s).",
            "description": "Define the default enqueue action for this media type (if you did not specify an action).",
            "options": {
                "play": "Play radio station now and keep the remaining queue item(s).",
                "replace": "Clear the queue and play the radio station",
                "next": "Play the item(s) right after the currently played\/buffered item.",
                "replace_next": "Clear the queue and play the radio station(s) right after the currently played\/buffered item.",
                "add": "Add the radio station(s) at the end of the queue."
            }
        },
        "default": "default",
        "reset_to_defaults": "Reset to defaults",
        "reset_to_defaults_confirm": "Are you sure you want to reset all settings to their default values? This will save the changes immediately.",
        "unsaved_changes": "Unsaved changes",
        "unsaved_changes_message": "You have unsaved changes. Are you sure you want to leave without saving?",
        "stay": "Stay",
        "discard": "Discard changes",
        "protocol_disabled_message": "Enable this protocol to configure its settings",
        "protocol_no_settings": "This output protocol does not have any additional configuration",
        "protocol_no_settings_with_advanced": "No settings visible. Enable advanced settings to see more configuration options.",
        "show_advanced_settings": "Show advanced settings",
        "advanced": "Advanced",
        "provider_depends_on_confirm": "Before you can set up {0}, you need to have the {1} provider configured, do you want to do that now?",
        "category": {
            "playback": "Queue Playback",
            "advanced": "Advanced",
            "generic": "Generic",
            "announcements": "Announcements",
            "player_controls": "Player controls",
            "sync_options": "Sync\/import options",
            "builtin_playlists": "Builtin Playlists",
            "web_player": "Web Player",
            "protocol_settings": "Output Protocol(s)",
            "protocol_output_settings": "Enable {0} support",
            "dsp": "Digital Signal Processing (DSP)",
            "options": "Player options"
        },
        "tts_pre_announce": {
            "label": "Pre-announce TTS announcements",
            "description": "When a TTS (text-to-speech) message is sent to the Announce feature, prepend the announcement with a short pre-announcement sound (bell whistle)."
        },
        "announce_volume_strategy": {
            "label": "Volume strategy for Announcements",
            "description": "When an announcement is being broadcast to this player, how should the volume be adjusted temporarily (use in combination with the volume value below)?",
            "options": {
                "absolute": "Absolute volume",
                "relative": "Relative volume increase",
                "percentual": "Volume increase by fixed percentage",
                "none": "Do not adjust volume"
            }
        },
        "announce_volume": {
            "label": "Volume for Announcements",
            "description": "The percentual, relative or absolute volume level, used with the strategy for announcements."
        },
        "announce_volume_min": {
            "label": "Minimum Volume level for Announcements",
            "description": "The volume (adjustment) of announcements should not go below this level."
        },
        "announce_volume_max": {
            "label": "Maximum Volume level for Announcements",
            "description": "The volume (adjustment) of announcements should not go above this level."
        },
        "icon": {
            "label": "Icon",
            "description": "Material design icon for this player.\n\nSee https:\/\/pictogrammers.com\/library\/mdi\/."
        },
        "theme": {
            "label": "Theme",
            "options": {
                "auto": "Auto (follow system configuration)",
                "light": "Light",
                "dark": "Dark"
            }
        },
        "menu_items": {
            "label": "Enabled menu items",
            "description": "Configure which items to show in the menu.\n\nNote that if you disable the settings you may lock yourself out.\n\nTo gain access again, you will need to manually enter the path to the settings or clear the browser cookies. Use at your own risk!"
        },
        "language": {
            "label": "Language",
            "options": {
                "auto": "Auto (follow system configuration)",
                "cs": "Czech",
                "da": "Danish",
                "de": "German",
                "en": "English",
                "fr": "French",
                "lv_LV": "Latvian",
                "nl": "Dutch",
                "pl": "Polish",
                "uk_UA": "Ukrainian",
                "zh_CN": "Chinese (Simplified)",
                "en_AU": "English (Australian)",
                "sr": "Serbian",
                "sr_Latn": "Serbian (Latin)",
                "sv_SE": "Swedish",
                "en_GB": "English (United Kingdom)",
                "es": "Spanish",
                "lt_LT": "Lithuanian",
                "pt_PT": "Portuguese",
                "ko_KR": "Korean",
                "nb": "Norwegian",
                "ru_RU": "Russian",
                "pt_BR": "Portuguese (Brazil)",
                "sl_SI": "Slovenian",
                "hu_HU": "Hungarian",
                "it": "Italian",
                "el_GR": "Greek"
            }
        },
        "no_music_providers": "No Music Providers configured",
        "no_music_providers_detail": "Start your Music Assistant experience by adding your Music providers.",
        "no_player_providers": "No Player Providers configured",
        "no_player_providers_detail": "Configure player providers to select devices where Music Assistant can output your music.",
        "volume_normalization_radio": {
            "label": "Volume normalization method to use for radio streams",
            "description": "Set the preferred volume normalization strategy for radio streams. \nBy default Music Assistant collects a measurement of the radio station's (average perceived) loudness according to the EBU-R128 specification and then adjusts the overall gain\/volume of the stream according to that measurement so the dynamic range of the audio is not affected. When no measurement (yet) exists for a radio station, Music Assistant will fallback to a dynamic (but less accurate) loudness levelling filter.\n\nTIP: Radio streams often have varying loudness levels, especially during announcements and commercials.\nYou can choose to enforce dynamic volume normalization to radio streams, even if a (average) loudness measurement for the radio station exists. \n \n**Options:**\n\n - Disabled - do not apply volume normalization at all for radio streams. \n  - Force dynamic - Enforce dynamic volume levelling at all times. \n  - Measurement only (no fallback) - Apply (overall) volume\/gain correction based on stored measurement. If we do not have any measurement, do not apply normalization.\n  - Fallback to gain correction - Apply (overall) volume\/gain correction based on stored measurement. If we do not have any measurement, fallback to a predefined gain correction.\n - Fixed gain correction - Always apply the fixed volume\/gain correction.\n  - Fallback to dynamic - Automatically pick the best option: Apply (overall) volume\/gain correction based on stored measurement if we have any, allow fallback to dynamic mode if no measurement is available.\n",
            "options": {
                "disabled": "Disabled",
                "dynamic": "Force dynamic",
                "measurement_only": "Measurement only (no fallback)",
                "fallback_fixed_gain": "Fallback to gain correction",
                "fixed_gain": "Fixed gain correction",
                "fallback_dynamic": "Fallback to dynamic"
            }
        },
        "volume_normalization_tracks": {
            "label": "Volume normalization method to use for tracks",
            "description": "Set the preferred volume normalization strategy for tracks\/songs.\nMusic Assistant uses a measurement of the tracks's (average perceived) loudness according to the EBU-R128 specification to adjust the overall gain\/volume of the stream without affecting the dynamic range of the audio.\nThese measurements are either provided by the streaming provider or in case of local files, can be contained in the ID3 tags (ReplayGain 2.0 \/ Opus R128).\nIf the measurement is not provided, Music Assistant will automatically perform a measurement when\/after the track is (first) played. When no measurement (yet) exists for a track, Music Assistant will by default fallback to a dynamic (but less accurate) loudness levelling filter. This ensures no big spikes\/falls in the volume level between tracks, even if there is no accurate measurement yet but the dynamic leveler can sometimes compress the dynamic range a bit, although that should not be audible in most cases.\n\n\n**Options:**\n\n - Disabled - do not apply volume normalization at all for radio streams.\n - Force dynamic - Enforce dynamic volume levelling at all times. \n - Measurement only (no fallback) - Apply (overall) volume\/gain correction based on stored measurement. If we do not have any measurement, do not apply normalization. \n - Fallback to gain correction - Apply (overall) volume\/gain correction based on stored measurement. If we do not have any measurement, fallback to a predefined gain correction. \n - Fixed gain correction - Always apply the fixed volume\/gain correction. \n - Fallback to dynamic - Automatically pick the best option: Apply (overall) volume\/gain correction based on stored measurement if we have any, allow fallback to dynamic mode if no measurement is available.\n",
            "options": {
                "disabled": "Disabled",
                "dynamic": "Force dynamic",
                "measurement_only": "Measurement only (no fallback)",
                "fallback_fixed_gain": "Fallback to gain correction",
                "fixed_gain": "Fixed gain correction",
                "fallback_dynamic": "Fallback to dynamic"
            }
        },
        "volume_normalization_fixed_gain_tracks": {
            "label": "Fixed\/fallback gain adjustment for tracks",
            "description": "Fixed\/fallback gain correction to apply to a track audio stream (depends on the 'Volume normalization method' setting).\nUse a positive value to increase the volume, a negative value to decrease the volume.\n\nThis setting is used when the volume normalization method is set to 'Fixed gain correction' or 'Fallback to gain correction'."
        },
        "volume_normalization_fixed_gain_radio": {
            "label": "Fixed\/fallback gain adjustment for radio",
            "description": "Fixed\/fallback gain correction to apply to a radio stream (depends on the 'Volume normalization method' setting).\nUse a positive value to increase the volume, a negative value to decrease the volume.\n\nThis setting is used when the volume normalization method is set to 'Fixed gain correction' or 'Fallback to gain correction'."
        },
        "add_group_player_desc_sync": "Create a permanent SyncGroup with players that are sync-compatible. When you play to this Player Group, the member players will be automatically synchronized.",
        "dynamic_members": {
            "label": "Dynamic group members",
            "description": "Allow members to (temporarily) join\/leave the group dynamically, so the group more or less behaves the same as manually syncing players together, with the main difference being that the group player will hold the queue."
        },
        "dsp": {
            "configure_on": "Configuring DSP on: {name}",
            "disabled_message": "DSP is currently disabled. Enable it using the switch above",
            "input": "Input",
            "output": "Output",
            "filter": {
                "add": "Add Filter",
                "type": "Filter Type",
                "new": "New {type}"
            },
            "move_up": "Move Up",
            "move_down": "Move Down",
            "delete_filter": "Delete Filter",
            "parametric_eq": {
                "add_band": "Add Band",
                "delete_band": "Delete Band",
                "filter_type": "Filter Type",
                "band": "Band {index}",
                "enable_band": "Enable Band",
                "filter_types": {
                    "peak": "Peak",
                    "low_shelf": "Low Shelf",
                    "high_shelf": "High Shelf",
                    "low_pass": "Low Pass",
                    "high_pass": "High Pass",
                    "notch": "Notch"
                },
                "import_apo": "Import APO\/REW Preset",
                "export_apo": "Export APO Preset",
                "preamp": "Preamp",
                "add_band_channel": "Add Band ({channel} only)",
                "band_channel": "Band {index} ({channel} only)",
                "show_multichannel_controls": "Show Multi-Channel controls",
                "edited_channel": "Plot the EQs response for this channel(s)",
                "channel": "This band will be applied to",
                "per_channel_preamp": "Additional preamp gain for {channel}"
            },
            "tone_control": {
                "bass_level": "Bass Level",
                "mid_level": "Mid Level",
                "treble_level": "Treble Level"
            },
            "parameter": {
                "frequency": "Frequency",
                "gain": "Gain",
                "q_factor": "Q Factor"
            },
            "types": {
                "parametric_eq": "Parametric EQ",
                "tone_control": "Tone Control"
            },
            "channels": {
                "ALL": "All",
                "FL": "Left",
                "FR": "Right"
            },
            "channels_compact": {
                "FL": "L",
                "FR": "R"
            },
            "presets": {
                "load": "Load DSP Preset",
                "empty_warning": "No DSP presets available",
                "save": "Save DSP Preset",
                "name": "Preset Name",
                "name_placeholder": "My new preset",
                "remove_confirm": "Are you sure you want to remove this DSP preset?"
            }
        },
        "power_control": {
            "label": "Power control",
            "description": "Define\/override the power control behavior for this player.\nIt allows you for example to redirect the power on\/off commands to a different appliance, or use a fake power control if your player does not support power on\/off commands but you like to have a dedicated state for a player not in use."
        },
        "volume_control": {
            "label": "Volume control",
            "description": "Define\/override the volume control behavior for this player.\nIt allows you for example to redirect the volume control commands to a different appliance, or disable it completely."
        },
        "mute_control": {
            "label": "Mute control",
            "description": "Define\/override the mute control behavior for this player.\nIt allows you for example to redirect the muting control commands to a different appliance, or disable it completely.\n\nWe offer a 'fake' mute control option, which will simulate muting by setting the volume to 0 and restoring the volume when unmuting."
        },
        "output_limiter": {
            "label": "Enable limiting to prevent clipping",
            "description": "Activates a limiter that prevents audio distortion by making loud peaks quieter."
        },
        "dsp_enabled": "DSP is enabled",
        "dsp_disabled": "DSP is disabled",
        "dsp_note_multi_device_group": {
            "label": "You can configure the DSP for each player individually."
        },
        "dsp_note_multi_device_group_unsupported": {
            "label": "This group type does not support DSP when playing to multiple devices."
        },
        "add_group_player_desc_universal": "By creating a Universal Player Group, you can group players from different providers\/ecosystems together. \nThis will distribute the same audio to all member players (but not in sync).",
        "edit_provider": "Edit provider: {0}",
        "metadata": "Metadata",
        "metadataprovider": "Metadata provider",
        "music": "Music",
        "musicprovider": "Music provider",
        "player": "Player",
        "playerprovider": "Player provider",
        "plugin": "Plugin",
        "pluginprovider": "Plugin provider",
        "providers_total": "{0} total provider{1}",
        "stage": {
            "label": "Stage",
            "options": {
                "stable": "Stable",
                "beta": "Beta",
                "alpha": "Alpha",
                "experimental": "Experimental",
                "unmaintained": "Unmaintained",
                "deprecated": "Deprecated"
            }
        },
        "force_mobile_layout": {
            "label": "Force mobile layout",
            "description": "Force the mobile layout (with the menu-navigation at the bottom), even on larger screens."
        },
        "mobile_sidebar_side": {
            "label": "Mobile sidebar side",
            "description": "Which side the navigation menu (sheet) opens from on mobile. Default is left.",
            "options": {
                "left": "Left",
                "right": "Right"
            }
        },
        "providers_description": "Manage your music sources, player providers and plugins",
        "players_description": "Configure and manage your audio output devices",
        "frontend_description": "Customize the user interface theme and appearance",
        "provider_type": "Type",
        "onboarding_title": "Welcome to Music Assistant!",
        "profile_description": "Manage your personal account settings and preferences",
        "users": "Users",
        "users_description": "Manage user accounts, roles, and permissions",
        "system_description": "Configure Music Assistant server settings and core modules",
        "system": "System",
        "view_documentation": "View documentation",
        "about": "About",
        "about_description": "Version information, credits and more",
        "system_logging": "Server Logging",
        "system_logging_description": "View and download server logs for troubleshooting",
        "genre_management": "Genre Management",
        "genre_management_description": "Manage default genres and restore genre defaults",
        "restore_missing_defaults": "Restore Missing Defaults",
        "restore_missing_defaults_description": "Adds any missing default genres without affecting your existing genres or custom mappings.",
        "full_restore_genres": "Full Restore (Reset All)",
        "full_restore_genres_description": "Deletes all genres and aliases, recreates the defaults, and remaps all existing media items. Use with caution!",
        "confirm_restore_defaults": "Restore missing default genres? This will add any missing default genres without deleting or modifying your existing genres.",
        "confirm_full_restore": "This will DELETE ALL existing genres and aliases, recreate only the defaults, and remap all existing media items to the new genres. All custom genres, alias mappings, and media associations will be lost.",
        "confirm_full_restore_2": "Are you absolutely sure? This action cannot be undone.",
        "restore_success": "Restored {0} missing genre(s).",
        "restore_all_present": "All default genres are already present.",
        "full_restore_success": "Full restore complete. {0} default genre(s) restored.",
        "genre_statistics": "Genre Statistics",
        "total_genres": "Total Genres",
        "view_all_genres": "View All Genres",
        "background_scanner": "Background Scanner",
        "error_loading_genres": "Error loading genres",
        "background_scanner_description": "Automatically maps tracks, albums, and artists to genres.",
        "scanner_status": "Scanner Status",
        "scanner_running": "Running...",
        "scanner_idle": "Idle",
        "last_scan": "Last Scan",
        "last_scan_mapped": "Items Mapped (Last Scan)",
        "scan_now": "Scan Now",
        "scan_triggered": "Genre scan started successfully.",
        "scan_already_running": "Genre scan is already in progress.",
        "scan_never": "Never",
        "scanner_status_failed": "Failed to fetch scanner status",
        "scan_trigger_failed": "Failed to trigger genre scan",
        "restore_defaults_failed": "Failed to restore genre defaults",
        "full_restore_failed": "Failed to perform full genre restore",
        "auto_refresh_log": "Auto-refresh",
        "log_truncated": "Showing last {0} lines. Download the full log file for complete history.",
        "version_info": "Version Information",
        "library_stats": "Library Statistics",
        "links": "Links",
        "changelog": "Changelog",
        "feature_requests": "Feature Requests",
        "bug_reports": "Bug Reports",
        "discussion_forums": "Discussion Forums",
        "license": "License",
        "open_home_foundation": "Open Home Foundation",
        "proud_part_of": "Proud part of",
        "core_module": {
            "cache": {
                "name": "Cache",
                "description": "Configuration of the core module that handles caching of data across the application"
            },
            "metadata": {
                "name": "Metadata",
                "description": "Configuration of the core metadata management module"
            },
            "music": {
                "name": "Music",
                "description": "Configuration of the core music (library) management module"
            },
            "players": {
                "name": "Players",
                "description": "Configuration of the core player management module"
            },
            "player_queues": {
                "name": "Player Queues",
                "description": "Configuration of the core player queue management module"
            },
            "remote_access": {
                "name": "Remote Access",
                "description": "Enables remote access to your Music Assistant server"
            },
            "streams": {
                "name": "Streams",
                "description": "Configuration of the audio streaming and processing engine"
            },
            "webserver": {
                "name": "Webserver",
                "description": "Configuration of the webserver and API"
            }
        },
        "remote_access": "Remote Access",
        "remote_access_description": "Securely access Music Assistant from anywhere",
        "remote_access_title": "Secure Remote Access",
        "remote_access_explanation_intro": "Remote Access allows you to securely connect to your Music Assistant server from anywhere in the world.",
        "remote_access_explanation_ha_cloud": "For the best experience and reliability, a Home Assistant Cloud subscription is required.",
        "remote_access_feature_webrtc": "Based on WebRTC technology for peer-to-peer connections",
        "remote_access_feature_encrypted": "End-to-end encrypted - your data stays private",
        "remote_access_feature_no_port_forwarding": "No port forwarding or VPN required",
        "remote_access_mode_optimized": "Optimized Mode (HA Cloud)",
        "remote_access_mode_basic": "Running in Basic Mode",
        "remote_access_mode_optimized_description": "Using STUN\/TURN servers from Home Assistant Cloud for optimal performance. Works reliably in all network configurations.",
        "remote_access_mode_basic_description": "Using public STUN servers. This may not work in complex network setups. Upgrade to Home Assistant Cloud for the best experience.",
        "remote_access_upgrade_to_optimized": "Upgrade to Home Assistant Cloud",
        "remote_access_status": "Remote Access Status",
        "remote_access_enabled": "Remote Access is enabled",
        "remote_access_disabled": "Remote Access is disabled",
        "remote_access_connected": "Connected",
        "remote_access_connecting": "Connecting...",
        "remote_access_your_id": "Your Remote Access ID",
        "remote_access_id_explanation": "Use this unique ID to connect to your Music Assistant server from remote devices:",
        "remote_access_copy_id": "Copy Remote ID",
        "remote_access_id_copied": "Remote ID copied to clipboard!",
        "remote_access_how_to_use": "How to Use Remote Access",
        "remote_access_step_1": "Go to",
        "remote_access_step_2": "Enter your Remote Access ID when prompted",
        "remote_access_step_3": "Connect and enjoy your music from anywhere!",
        "remote_access_technical_details": "Technical Details",
        "remote_access_connection_flow": "Connection Flow Diagram",
        "remote_access_signaling_server": "Signaling Server",
        "remote_access_protocol": "Connection Protocol",
        "remote_access_encryption": "Encryption",
        "remote_access_error_loading": "Failed to load remote access information",
        "remote_access_error_toggle": "Failed to toggle remote access",
        "remote_access_error_copy": "Failed to copy Remote ID",
        "remote_access_enabled_success": "Remote Access has been enabled",
        "remote_access_disabled_success": "Remote Access has been disabled",
        "remote_access_signaling_server_description": "Signaling server in the cloud, hosted by the Open Home Foundation.",
        "remote_access_protocol_basic": "WebRTC with public STUN servers (may not work in complex network setups).",
        "remote_access_protocol_optimized": "WebRTC with optimized STUN\/TURN servers from Home Assistant Cloud (works in all network setups).",
        "remote_access_encryption_description": "End-to-end encryption using DTLS-SRTP ensures your data remains private and secure.",
        "frontend": "User Interface",
        "players_count": "{0} player{1}",
        "one_player": "1 player",
        "view_players": "View players",
        "players_total": "{0} total player{1}",
        "api_docs": "API Documentation",
        "no_group_providers": "You currently do not have any providers that support creating groups",
        "web_player_enabled": {
            "label": "Enable built-in (Sendspin) Web Player",
            "description": "Allow playback to this device/browser using the built-in Sendspin web player."
        },
        "sendspin_sync_delay": {
            "label": "Sendspin sync delay (ms)",
            "description": "Static delay in milliseconds to adjust audio synchronization. Positive values delay playback, negative values advance it. Use this to compensate for device-specific audio latency."
        },
        "sendspin_output_latency_compensation": {
            "label": "Use browser latency detection",
            "description": "Automatically compensate for hardware audio latency (e.g., Bluetooth headphones) using the browser's output latency API. This API is fairly new and may not work reliably on all browsers and operating systems."
        },
        "enable_browser_controls": {
            "label": "Enable browser media controls",
            "description": "Allow control of playback using the browser's built-in media controls (e.g., media keys on your keyboard)."
        },
        "provider_codeowners": "This provider is contributed\/maintained by",
        "provider_credits": "Made possible by",
        "onboarding_subtitle": "Let's get you started by connecting your music sources and audio devices.",
        "onboarding_music_title": "Music",
        "onboarding_music_desc": "Connect your streaming services like Spotify, Tidal, or your local music library.",
        "onboarding_add_music": "Add Music",
        "onboarding_player_title": "Players",
        "onboarding_player_desc": "Connect your speakers and devices like Sonos, Chromecast, or AirPlay.",
        "onboarding_add_player": "Add Players",
        "onboarding_footer": "You can always add more providers later from this settings page.",
        "remote_access_qr_code": "QR Code",
        "remote_access_qr_code_description": "Scan with your phone camera to connect instantly."
    },
    "show_info": "Show info",
    "show_select_boxes": "Show selection boxes",
    "shuffle": "Shuffle",
    "sort": {
        "duration": "Duration",
        "position": "Position",
        "provider": "Provider",
        "sort_name": "Sort name",
        "track_number": "Track number",
        "year": "Release year",
        "position_desc": "Position (descending)",
        "album": "Album",
        "artist": "Artist",
        "name": "Alphabetically",
        "name_desc": "Alphabetically (descending)",
        "recent": "Recently added",
        "year_desc": "Release year (descending)",
        "duration_desc": "Duration (descending)",
        "original": "Original",
        "sort_name_desc": "Sort name (descending)",
        "timestamp_added": "Date added",
        "timestamp_added_desc": "Date added (descending)",
        "timestamp_modified": "Date updated",
        "timestamp_modified_desc": "Date updated (descending)",
        "last_played": "Last played",
        "last_played_desc": "Last played (descending)",
        "play_count": "Play count",
        "play_count_desc": "Play count (descending)",
        "artist_name": "Album artist",
        "artist_name_desc": "Album artist (descending)"
    },
    "state": {
        "idle": "idle",
        "off": "off",
        "paused": "paused",
        "playing": "playing"
    },
    "sync_now": "Synchronize now",
    "sync_running": "One or more music providers are being synchronized.",
    "tooltip": {
        "album_artist_filter": "Toggle album-artist filter",
        "hide_empty_genres": "Hide empty genres",
        "show_empty_genres": "Show empty genres",
        "explicit": "Explicit",
        "filter_library": "Toggle in-library\/favorite filter",
        "library": "Toggle in-library\/favorite",
        "linked": "This provideritem is linked to the current itemdetails",
        "refresh": "Refresh the items listing",
        "refresh_new_content": "New content is available, click to refresh the listing",
        "search": "Show\/hide search input",
        "select_items": "Select multiple items",
        "sort_options": "Sort options",
        "toggle_view_mode": "Toggle view mode list\/thumbs",
        "filter_favorites": "Only show favorites",
        "favorite": "Mark\/unmark as a favorite",
        "open_provider_link": "Open this item on the provider's website",
        "collapse_expand": "Collapse\/expand this listing",
        "back": "Back",
        "show_menu": "Show\/hide menu",
        "search_filter_active": "Search is currently filtering results",
        "play_sample": "Play sample",
        "album_type": "Album type",
        "loading": "The server is processing a request or syncing music.",
        "primary_image": "This is the primary image for this image type",
        "copy_uri": "Copy URI to clipboard",
        "select_all": "Select all items",
        "filter_provider": "Filter by music provider",
        "in_provider_library": "This item is in the provider's library",
        "filter_genre": "Filter by genre"
    },
    "topresult": "Top result",
    "track": "Track",
    "track_number": "Disc {0} Track {1}",
    "tracks": "Tracks",
    "try_global_search": "Try global search",
    "type_to_search": "Type here to search...",
    "volume_normalization": "Volume normalization",
    "play_now_replace": "Play Now (clear queue)",
    "currently_playing": "Currently playing",
    "favorites_add": "Add to favorites",
    "favorites_remove": "Remove from favorites",
    "confirm_library_remove": "Are you sure you want to delete this item from the library? Any items depending on this item will also be recursively removed. Note that this will only remove this item from the library. If this is a music file on disk, it may return on the next sync.",
    "check_item_on_provider": "Check {0} on {1}",
    "check_item_in_library": "Check {0} in the library",
    "media_details": "Media details",
    "mapped_providers": "Provider details",
    "item_in_library": "This item is available in the library",
    "back": "Back",
    "recently_played": "Recently played",
    "radiobrowser_by_country": "By country",
    "radiobrowser_by_tag": "By tag",
    "load_more_items": "Load more items...",
    "radio": "Radio",
    "more_options": "More options",
    "muted": "muted",
    "enter_name": "Enter a new (custom) name",
    "image_url": "Input the URL to an image or icon (optional)",
    "invalid_input": "The input was invalid",
    "new_playlist": "New playlist",
    "create_playlist_on": "Create new playlist on {0}",
    "view": {
        "list": "List view",
        "panel": "Thumbs view",
        "panel_compact": "Compact thumbs view"
    },
    "play_replace": "Play Now (clear queue)",
    "played": "Played",
    "background_task_added": "The action is performed by the server in the background and may take some time to complete. Keep an eye on the server log for progress.",
    "images": "Images",
    "image_type": "Type",
    "image_source": "Source",
    "image_make_primary": "Make primary",
    "update_metadata": "Update metadata",
    "cancel": "Cancel",
    "transfer_queue": "Transfer queue",
    "save_queue_as_playlist": "Save queue as playlist",
    "playlist_created": "Playlist created",
    "open_playlist": "Open playlist",
    "power_on_player": "Power on",
    "power_off_player": "Power off",
    "powered_off_players": "Unpowered players",
    "sync_player_with": "Synchronize with another player",
    "open_player_settings": "Open settings",
    "select_repeat_mode": "Select repeat mode",
    "repeat_mode": {
        "all": "Repeat entire queue",
        "off": "Repeat off",
        "one": "Repeat single track"
    },
    "shuffle_disable": "Disable shuffle",
    "shuffle_enable": "Enable shuffle",
    "dont_stop_the_music_enable": "Enable 'Don't stop the music!'",
    "dont_stop_the_music_disable": "Disable 'Don't stop the music!'",
    "open_dsp_settings": "Open DSP settings",
    "audiobook": "Audiobook",
    "audiobooks": "Audiobooks",
    "chapter": "Chapter",
    "chapters": "Chapters",
    "podcast": "Podcast",
    "podcasts": "Podcasts",
    "item_fully_played": "This item has been fully played",
    "item_in_progress": "This item has been partially played",
    "duration_in_seconds": "{0} seconds",
    "mark_played": "Mark as played",
    "mark_unplayed": "Mark as unplayed",
    "searchtype_all": "All",
    "global_search": "Global search",
    "podcast_episode": "Episode",
    "podcast_episodes": "Episodes",
    "play_from_here": "Play from here",
    "loudness_measurement": "{0} LUFS",
    "loudness_measurement_album": "{0} LUFS (album)",
    "loudness_dynamic": "Dynamic volume normalization",
    "loudness_fixed": "Fixed gain correction",
    "dsp_active": "Active",
    "currently_playing_players": "Currently playing",
    "all_players": "All players",
    "all_groups": "All groups",
    "no_player_playing": "No players are currently playing",
    "stop_playback": "Stop playback",
    "streamdetails": {
        "input_header": "Input",
        "output_header": "Output",
        "output_format_info": "Audio is sent in the {0} format",
        "eq_band_count": "{0} bands",
        "eq_band_count_singular": "1 band",
        "input_gain": "Input Gain ({0} dB)",
        "output_gain": "Output Gain ({0} dB)",
        "output_limiter": "Output Limiter",
        "output_limiter_info": "Automatically reduces very loud sounds to prevent distortion and protect your speakers",
        "dsp_unsupported": "DSP not supported",
        "dsp_disabled_by_unsupported_group": "This player provider does not support DSP with synchronized playback",
        "file_info": {
            "container": "Container: {0}",
            "codec": "Codec: {0}",
            "bit_rate": "Bit rate: {0} kbps",
            "sample_rate": "Sample rate: {0} kHz",
            "channels": "Channels: {0}",
            "bit_depth": "Bit depth: {0}",
            "processing_notice": "Audio is processed internally as 32-bit float PCM"
        },
        "volume_normalization": {
            "target_level": "Target level: {0} LUFS",
            "integrated_loudness": "Measured (integrated) loudness: {0} LUFS",
            "integrated_album_loudness": "Album loudness: {0} LUFS",
            "applied_gain_correction": "Applied gain correction: {0} dB",
            "mode": {
                "dynamic": "Volume normalization is active in the dynamic mode.",
                "measurement_only": "Volume normalization is active based on a stored measurement of the (integrated) loudness of the audio.",
                "measurement_album": "Volume normalization is active based on a stored measurement of the (integrated) loudness of the album.",
                "fixed_gain": "Volume normalization is active based on fixed gain correction."
            }
        },
        "click_to_expand": "Click to show all players",
        "output_format_pcm_info": "Audio is passed as PCM to the player provider. The player provider may then convert the audio to a different format before sending it to the player."
    },
    "volume_normalization_gain_correction": "{0} dB",
    "select_source": "Select source",
    "select_sound_mode": "Select sound mode",
    "in_progress_items": "Continue listening...",
    "play_replace_next": "Play Next (clear queue)",
    "all_enqueue_options": "All enqueue options",
    "music_assistant_source": "Music Assistant Queue",
    "music_assistant_library": "Music Assistant Library",
    "select_all_confirmation": "Select all items? This operation may take a moment to load all data.",
    "this_device": "This device",
    "recommendations": {
        "in_progress_items": "Continue listening...",
        "recommended_new_tracks": "Recommended new tracks",
        "recently_played": "Recently played",
        "suggested_new_albums_for_you": "Suggested new albums for you",
        "random_artists": "Random artists",
        "random_albums": "Random albums",
        "custom_mixes": "Custom mixes",
        "your_listening_history": "Your listening history",
        "popular_albums": "Popular albums",
        "staff_picks_tracks": "Staff picks: tracks",
        "staff_picks_albums": "Staff picks: albums",
        "radio_stations_for_you": "Radio stations for you",
        "producers__songwriters": "Producers & songwriters",
        "new_releases_for_you": "New releases for you",
        "recent_favorite_tracks": "Recently favorited tracks",
        "favorite_playlists": "Favorite playlists",
        "favorite_radio_stations": "Favorite radio stations",
        "listen_again": "Listen again",
        "in_progress_series": "Continue series...",
        "recommended": "Recommended",
        "recently_added": "Recently added",
        "episodes_recently_added": "Recently added episodes",
        "recent_series": "Recent series",
        "newest_authors": "Newest authors",
        "newest_episodes": "Newest episodes",
        "discover": "Discover",
        "libraries": "Libraries",
        "library": "Library",
        "trending_podcasts": "Trending podcasts"
    },
    "homescreen_edit_enable": "Edit Home screen",
    "homescreen_edit_disable": "Leave Home screen edit mode",
    "lyrics_will_appear_soon": "Lyrics will appear when the song begins...",
    "radiobrowser_by_votes": "By votes",
    "radiobrowser_by_clicks": "By clicks",
    "radiobrowser_by_language": "By language",
    "optional": "Optional",
    "created": "Created",
    "last_used": "Last used",
    "create": "Create",
    "are_you_sure": "Are you sure?",
    "auth": {
        "login_title": "Sign in to your account",
        "username": "Username",
        "username_readonly": "Username cannot be changed",
        "password": "Password",
        "confirm_password": "Confirm password",
        "display_name": "Display name",
        "display_name_readonly": "Display name editing not yet available",
        "login": "Sign in",
        "logout": "Sign out",
        "field_required": "This field is required",
        "username_min_length": "Username must be at least 3 characters",
        "username_already_exists": "Username already exists. Please choose a different username.",
        "invalid_username": "Invalid username. Please choose a different username.",
        "password_min_length": "Password must be at least 8 characters",
        "passwords_must_match": "Passwords must match",
        "login_failed": "Login failed. Please check your credentials.",
        "login_error": "An error occurred during login",
        "setup_subtitle": "Let's get started",
        "create_admin_account": "Create your admin account",
        "setup_description": "Create your administrator account to manage Music Assistant. This account will have full access to all settings and features.",
        "create_account": "Create account",
        "setup_failed": "Setup failed. Please try again.",
        "setup_error": "An error occurred during setup",
        "profile": "Profile",
        "account_settings": "Account settings",
        "manage_your_profile_info": "Manage your profile information and settings",
        "change_password": "Change password",
        "update_your_password": "Update your account password",
        "old_password": "Current password",
        "new_password": "New password",
        "password_changed": "Password changed successfully",
        "password_change_failed": "Failed to change password",
        "tokens": "Access tokens",
        "active_sessions": "Active sessions",
        "manage_active_sessions": "View and manage your active login sessions",
        "active_sessions_description": "These are sessions created when you sign in. They automatically renew when used and expire after 30 days of inactivity.",
        "no_active_sessions": "No active sessions",
        "long_lived_tokens": "Long-lived access tokens",
        "api_tokens_description": "Create and manage API tokens for external integrations",
        "long_lived_tokens_description": "Long-lived tokens are used for external integrations and API access. They expire after 10 years and do not auto-renew.",
        "no_long_lived_tokens": "No long-lived access tokens",
        "no_tokens": "No tokens yet",
        "create_token_hint": "Create a token to use Music Assistant with external applications",
        "token_name": "Token name",
        "token_name_hint": "e.g., 'Home Assistant', 'Mobile App'",
        "create_token": "Create new token",
        "revoke_token": "Revoke token",
        "revoke_token_confirm": "Are you sure you want to revoke this token? This action cannot be undone.",
        "revoke_session": "Revoke session",
        "revoke_session_confirm": "Are you sure you want to revoke this session? This action cannot be undone.",
        "revoke": "Revoke",
        "token_revoked": "Token revoked successfully",
        "token_revoke_failed": "Failed to revoke token",
        "session_revoked": "Session revoked successfully",
        "session_revoke_failed": "Failed to revoke session",
        "manage_tokens": "Manage access tokens",
        "token_created": "Token created successfully",
        "token_create_failed": "Failed to create token. Please try again.",
        "user_management": "User management",
        "users": "Users",
        "create_user": "Create user",
        "edit_user": "Edit user",
        "role": "Role",
        "admin_role": "Administrator",
        "user_role": "User",
        "enabled": "Enabled",
        "disabled": "Disabled",
        "enable_user": "Enable user",
        "disable_user": "Disable user",
        "user_created": "User created successfully",
        "user_create_failed": "Failed to create user",
        "user_updated": "User updated successfully",
        "user_update_failed": "Failed to update user",
        "user_deleted": "User deleted successfully",
        "user_delete_failed": "Failed to delete user",
        "user_disabled": "User disabled successfully",
        "user_disable_failed": "Failed to disable user",
        "user_enabled": "User enabled successfully",
        "user_enable_failed": "Failed to enable user",
        "password_optional_hint": "Leave blank to keep current password",
        "confirm_disable_user": "Are you sure you want to disable this user?",
        "confirm_delete_user": "Are you sure you want to delete this user? This action cannot be undone.",
        "delete_user": "Delete user",
        "admin_required": "Administrator access required",
        "change_role": "Change role",
        "avatar_url": "Avatar URL",
        "avatar_url_hint": "Enter URL to avatar image",
        "change_avatar": "Change avatar",
        "profile_updated": "Profile updated successfully",
        "save_changes": "Save changes",
        "update_password": "Update password",
        "ingress_password_note": "When accessing Music Assistant outside of Home Assistant, you will need this password to sign in.",
        "copy_new_token_hint": "Copy your access token. It will not be shown again.",
        "token_copied": "Token copied to clipboard",
        "token_copy_failed": "Failed to copy token to clipboard",
        "player_filter": "Player filter",
        "player_filter_hint": "Restrict this user to access only the selected players. Leave empty for full access to all players.",
        "provider_filter": "Music provider filter",
        "provider_filter_hint": "Restrict this user to access only the selected music providers. Leave empty for full access to all music providers.",
        "no_players_selected": "All players (no restrictions)",
        "no_providers_selected": "All providers (no restrictions)",
        "select_players": "Select players",
        "select_providers": "Select providers"
    },
    "login": {
        "subtitle": "Connect to your music server",
        "auto_connecting": "Looking for your server...",
        "sign_in_to_continue": "Sign in to continue",
        "complete_in_browser": "Complete sign-in in your browser",
        "establishing_connection": "Establishing connection...",
        "local_server": "Local Server",
        "remote_server": "Remote",
        "server_address": "Server Address",
        "server_address_placeholder": "http:\/\/192.168.1.100:8095",
        "remote_id": "Remote ID",
        "remote_id_placeholder": "e.g., MA-X7K9-P2M4",
        "remote_id_hint": "Find this in your server settings under \"Remote Access\"",
        "connect": "Connect",
        "username": "Username",
        "username_placeholder": "Enter your username",
        "password": "Password",
        "password_placeholder": "Enter your password",
        "sign_in": "Sign In",
        "or_continue_with": "Or continue with",
        "sign_in_with_ha": "Sign in with Home Assistant",
        "back": "Back",
        "cancel": "Cancel",
        "different_server": "Use different server",
        "connecting": "Connecting...",
        "connecting_to_server": "Connecting to server...",
        "connecting_to_signaling": "Connecting to signaling server...",
        "checking_stored": "Checking for saved connection...",
        "connecting_to_saved": "Connecting to saved server...",
        "connecting_remote": "Connecting to remote server...",
        "authenticating": "Authenticating...",
        "checking_local": "Checking local server...",
        "finding_server": "Finding your server...",
        "establishing_secure": "Establishing secure connection...",
        "complete_sign_in": "Complete Sign-in",
        "oauth_waiting_message": "A browser window has opened. Please sign in with Home Assistant, then return here.",
        "waiting_for_auth": "Waiting for authentication...",
        "connection_failed": "Connection Failed",
        "try_again": "Try Again",
        "error_unknown": "Unknown error occurred",
        "error_login_failed": "Login failed. Please check your credentials.",
        "error_oauth_failed": "Failed to authenticate with Home Assistant.",
        "scan_qr": "Scan QR",
        "scan_qr_code": "Scan QR Code",
        "scan_qr_hint": "Point your camera at the QR code shown in your Music Assistant server settings.",
        "qr_invalid": "Invalid QR code. Please scan a Music Assistant remote ID QR code.",
        "qr_camera_error": "Could not access camera. Please check permissions."
    },
    "remote": {
        "connect_title": "Connect to your server",
        "subtitle": "Connect to your home server from anywhere",
        "subtitle_login": "Sign in to access your music",
        "remote_id": "Remote ID",
        "remote_id_placeholder": "e.g., MA-X7K9-P2M4",
        "remote_id_hint": "Find your Remote ID in your Music Assistant server settings under \"Remote Access\".",
        "recent_connections": "Recent Connections",
        "connect": "Connect",
        "connect_locally": "Connect to local server instead",
        "login_title": "Sign in to your server",
        "username": "Username",
        "password": "Password",
        "remember_me": "Remember me on this device",
        "sign_in": "Sign In",
        "back": "Back",
        "connecting": "Connecting...",
        "status_connecting_signaling": "Connecting to signaling server...",
        "status_finding_server": "Finding your server...",
        "status_establishing": "Establishing secure connection...",
        "cancel": "Cancel",
        "connection_failed": "Connection Failed",
        "retry": "Try Again",
        "error_unknown": "Unknown error occurred",
        "error_login_failed": "Login failed. Please check your credentials.",
        "error_server_not_found": "Server not found. Make sure your Music Assistant server is running and has Remote Access enabled.",
        "login_with_ha": "Sign in with Home Assistant",
        "or": "or",
        "subtitle_oauth": "Complete sign-in in your browser",
        "oauth_waiting_title": "Complete Sign-in",
        "oauth_waiting_message": "A browser window has opened. Please sign in with Home Assistant, then return here.",
        "oauth_waiting_hint": "Waiting for authentication...",
        "error_oauth_failed": "Failed to authenticate with Home Assistant."
    },
    "yes": "Yes",
    "no": "No",
    "uri_copied": "URI copied to clipboard",
    "uri_copy_failed": "Failed to copy URI to clipboard",
    "search_all_providers": "Search all providers for matches",
    "search_all_providers_confirm": "Are you sure you want to search for matches on all providers? This can take some time to complete and will be executed in the background.",
    "remove_provider_mapping": "Remove provider mapping",
    "remove_provider_mapping_confirm": "Are you sure you want to remove this provider mapping? This will unlink the item from the current item details. It may come back if you perform a rescan for all provider matches.",
    "map_provider_mapping": "Map this provider entry to the current item"
}
